app/Controllers/Auth.php

SELECT *
FROM `refauth`
WHERE `username` = 'admin_edusmara'
AND `is_active` = 1
---
        }

        // --- VERIFIKASI USER DI DATABASE ---
        $user = $this->db->table('refauth')
            ->where(['username'=>$username, 'is_active'=>1])
            ->get()
            ->getRowArray();

UPDATE `refauth` SET `last_login_at` = '2026-09-08 23:22:52', `last_login_ip` = '::1', `last_user_agent` = 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/152.0.0.0 Safari/537.36', `active_session_token` = '8nwpy01fujsaierv'
WHERE `id_auth` = '1'
---


        // Update last_login di database
        $this->db->table('refauth')
            ->where('id_auth', $user['id_auth'])
            ->update(['last_login_at' => waktu(), 'last_login_ip' => $this->request->getIPAddress(),'last_user_agent' => $this->request->getUserAgent(), 'active_session_token' => $this->session->getTempdata('device_hash')]);

SELECT COUNT(*) AS `numrows`
FROM `device_logs`
WHERE `ip_address` = '::1'
AND `device_hash` = '8nwpy01fujsaierv'
---
    private function checkLockout(){
        $exists = $this->db->table('device_logs')
                        ->where(['ip_address' => $this->session->getTempdata('ip_address'), 'device_hash' => $this->session->getTempdata('device_hash')])
                        ->countAllResults() > 0;